# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LeaderArray..::..ForwardIterator Method
LeaderArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual LeaderArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As LeaderArrayIterator
```

Visual C++
---
```text
public:
virtual LeaderArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
LeaderArray Class
Autodesk.Revit.DB Namespace